Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །བྲམ་ཟེ་དྲང་སྲོང་གཞུང་ཅན་གྱི། །དྲུང་དུ་ཉེ་བར་བཞུད་པར་མཛོད།
en: A brahmin, a ṛṣi, a master.’

source: །རྒྱལ་པོ་དེས་ནི་བུ་ཐུ་བོ།
en: “The king put his eldest son,

source: །འཇིགས་མེད་རྒྱལ་སྲིད་ལ་བཞག་སྟེ།
en: Who was free from fear, upon the throne.

source: །རྒྱལ་མཆོག་རྒྱལ་སྲིད་སྤངས་ནས་ནི།
en: Having relinquished his throne, this most excellent king

source: །ནང་མི་དང་ནི་བློན་ཆེན་དང་། །གྲོང་ཁྱེར་པ་ནི་ཐམས་ཅད་དང་། །གཉེན་གྱི་ཚོགས་ཀྱིས་ཡོངས་བསྐོར་ནས།
en: “Surrounded by his family, ministers, All the citizens And his relatives,

source: །རབ་ཏུ་འབྱུང་ཕྱིར་མངོན་དུ་བྱུང་།
en: He left to go forth.

source: །མགོ་བོས་ཕྱག་ནི་བྱས་ནས་ཀྱང་། །རྒྱལ་པོས་ཐལ་མོ་སྦྱར་ནས་ནི།
en: And made the gesture of supplication,

source: །སྟོང་ཕྲག་དག་ནི་དུ་མ་དང་། །ཁྱིམ་མེད་པར་ནི་རབ་བྱུང་སྟེ།
en: “Together with hundreds of thousands of people, He went forth into homelessness.

source: །སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཀྱང་།
en: Having shaved off his hair and beard,

source: །ངུར་སྨྲིག་གོས་ནི་བགོས་པར་གྱུར།
en: He donned saffron robes. “The master, whose mind was well adjusted, Fully preached the Dharma

source: །གཞུང་ཅན་ཤིན་ཏུ་མཉམ་བཞག་པས།
en: On the four pure abodes,

source: །ཚངས་པའི་འཇིག་རྟེན་སྐྱེ་འགྱུར་བའི། །ཚངས་པའི་གནས་པ་བཞི་པོ་ཡི།
en: Which leads to birth in the world of Brahmā.

source: །ཆོས་ནི་ཀུན་ལ་བཤད་པར་བྱས།
en: “I attended on the king

source: །གུས་དང་བཅས་པའི་བྱམས་སེམས་ཀྱིས། །རྒྱལ་པོ་དེ་ཡི་རིམ་གྲོ་བྱས།
en: With a respectful, affectionate mind.

source: །འོད་གསལ་རྣམས་སུ་སོང་བར་གྱུར།
en: And went to the Clear Light Heaven.

source: །འོད་གསལ་ནས་ནི་ཤི་འཕོས་ནས།
en: “After dying in the Clear Light Heaven,

source: །སླར་ཡང་འདིར་ནི་འོངས་པ་ན།
en: I came back here again,

source: །ནོར་ཆེ་བ་དང་ཕྱུག་པོར་གྱུར།
en: I was wealthy and possessed much property. “I experienced much of the happiness

source: །ལྷ་རྣམས་དང་ནི་མི་རྣམས་ཀྱི། །བདེ་བ་མང་པོ་ཉམས་སུ་མྱོང་།
en: Of gods and humans.

source: །དུས་ཀྱི་ཐ་མ་འདི་ལ་ནི།
en: At this final time,

source: །བདག་གི་ལུས་ཀྱི་ཐ་མ་ལ། །ཤཱཀྱ་རྣམས་ཀྱི་ཡུལ་དུ་ནི།
en: In my final body,

source: །གྲོང་ཁྱེར་སེར་སྐྱ་ཞེས་བྱར་སྐྱེས།
en: “I was born in a city called Kapilavastu

source: །སྤྱོད་ཡུལ་སྤྱོད་པ་ཕུན་ཚོགས་པའི།
en: In the country of the Śākyans.

source: །ཤཱཀྱ་རྣམས་ཀྱི་འདྲེག་མཁན་གྱུར།
en: I was a barber of the Śākyans, Who had vast land and abundant wealth.

source: །ཤཱཀ་སྲས་ཐུགས་བརྩེའི་བདག་ཉིད་ཅན།
en: “I attended on the Śākyan son, who was naturally compassionate,

source: །ཉན་ཐོས་བཅས་ལ་རིམ་གྲོ་བྱས།
en: And his disciples.

source: །རྒྱལ་པོ་ཆེན་པོའི་འབྱོར་པས་ནི།
en: Displaying the wealth of great kings,

source: །རབ་ཏུ་འབྱུང་བར་མངོན་འབྱུང་བ།
en: They departed to go forth.

source: །དེ་རྣམས་བདག་གིས་སྐྲ་བྲེགས་ནས།
en: “Having shaved their hair,

source: །དཔོན་པོ་འཚོ་བ་མ་སྩལ་ན།
en: ‘If my lords do not give me a means of livelihood,

source: །བདག་ནི་ཇི་ལྟར་འཚོ་བར་འགྱུར།
en: How can I make my living?’ “They gave me their accessories

source: །དེ་ཡི་རྒྱན་ནི་གང་ཡིན་དང་། །གོས་རྣམས་གྱོན་པ་གང་ཡིན་པ།
en: And clothes they had worn, Saying, with pleasure,

source: །འདི་ནི་ཁྱོད་ཀྱི་འཚོ་བའོ་ཞེས། །དེས་ནི་ཀུན་དགའ་བདག་ལ་བྱིན།
en: ‘These are your means of livelihood.’

source: །རིན་ཆེན་མང་པོ་བརྟགས་ནས་ནི།
en: “Having thought about the many treasures,

source: །དེ་ལ་བདག་ནི་སྐྱོ་གྱུར་ནས།
en: I was agitated there:

source: །འདི་དག་ཐམས་ཅད་སྤངས་ནས་ནི།
en: ‘I will relinquish all of these

source: །བདག་ནི་རབ་འབྱུང་གསོལ་བ་བྱ།
en: And ask for permission to go forth.

source: །བཀྲེན་པ་བདག་ལ་འདི་ལྟ་བུའི། །རིན་ཆེན་རྣམས་ཀྱིས་ཅི་ཞིག་བྱ།
en: “ ‘What use are such treasures For me, one who is poor?

source: །གཞན་འགའ་ཞིག་གིས་ཐོས་ན་ནི།
en: If someone hears of this,

source: །སྲོག་ལ་གདོན་ལྟོ་ཟ་བར་འགྱུར།
en: He will certainly kill me.

source: །བདག་གིས་ཉིད་ཀྱི་སྣོད་སྤྱད་ནི།
en: “ ‘Having tied my tools

source: །གང་ཡིན་ཤིང་ལ་བཏགས་ནས་སུ།
en: Around a tree

source: །བོར་ནས་བདག་ནི་ཁྱིམ་དག་ནས། །བྱུང་སྟེ་ངེས་པར་འབྱུང་བར་བྱ།
en: And abandoned them, I should surely leave my house and depart.

source: །བདག་ནི་རིན་ཆེན་དོན་གཉེར་མིན།
en: “ ‘I am not a seeker after treasures.

source: །བདག་གི་ཚིག་དེ་ཤཱཀྱ་ཡི། །རྒྱལ་པོས་ཐོས་ནས་འདི་སྐད་སྨྲས།
en: Having heard these words of mine, The king of the Śākyans said,

source: །ཁྱོད་ནི་ཐོག་མར་རབ་བྱུང་དང་། །རྒན་པ་ཉིད་དུ་ཁྱོད་འགྱུར་རོ།
en: “ ‘You will be the first to go forth And so you will be the eldest.’

source: །རྗེས་སུ་ཐུགས་བརྩེར་དགོངས་ནས་ནི།
en: With compassionate consideration,

source: །བདག་ལ་དགེ་སློང་ཚུར་ཤོག་གསུངས།
en: The Buddha said to me, ‘Come, monk.’

source: །བདག་ནི་ཐོག་མར་རབ་ཏུ་བྱུང་།
en: “I was the first to go forth.

source: །དེ་ནས་རྒྱལ་རིགས་རབ་བྱུང་ནས།
en: Thereafter, the royal family members went forth

source: །བདག་གི་རྐང་ལ་ཕྱག་བྱས་པས།
en: And bowed to my feet.

source: །ཤཱཀྱ་དེ་རྣམས་ང་རྒྱལ་བོར།
en: Thus the Śākyans removed their haughtiness.

source: །དེ་ལྟར་བདག་ནི་རབ་བྱུང་བས།
en: “Thus I went forth.

source: །མངོན་པར་ཤེས་པ་དྲུག་རེག་ནས།
en: I achieved the six kinds of supernormal knowledge.

source: །དགྲ་བཅོམ་མངོན་ཤེས་དྲུག་ལྡན་ཞིང་།
en: As an arhat possessed of the six kinds of supernormal knowledge,

source: །བདག་ནི་འདུལ་བའི་ཕ་རོལ་ཕྱིན།
en: I perfected myself in the Vinaya. “I was praised by the Teacher himself

source: །སྟོན་པ་ཉིད་ཀྱིས་འདུལ་བ་འཛིན། །རྣམས་ཀྱི་མཆོག་ཏུ་བསྔགས་པ་སྟེ།
en: As the best of Vinaya holders.”

source: །མ་དྲོས་པ་ཡི་མཚོ་ཆེན་དུ། །ཉེ་བ་འཁོར་གྱིས་ལས་ལུང་བསྟན།
en: On the great lake Anavatapta.

source: །ཉེ་བ་འཁོར་གྱི་ལེའུ་སྟེ་སུམ་བཅུ་རྩ་བཞི་པའོ།། །།
en: Here ends the thirty-fourth section: The Section of Upālin. 5. Prabhākara

source: དེ་ནས་འཇིག་རྟེན་མགོན་པོས་ནི།
en: Thereupon the Protector of the World

source: །གནས་བརྟན་འོད་བྱེད་ལ་གསུངས་པ།
en: Said to the Elder Prabhākara, “Explain the karma

source: །ཁྱོད་ཀྱིས་སྔོན་བྱས་གང་ཡིན་པའི།
en: You created in the past.”

source: །རང་གི་ལས་ནི་ལུང་སྟོན་ཅིག །རྒྱལ་བའི་གསུང་དབྱངས་ཐོས་ནས་ནི།
en: “Having heard the Victor’s words,

source: །སྔོན་ཆད་བདག་གིས་གང་བགྱིས་པའི། །རང་གི་ལས་ནི་དྲན་པ་གང་།
en: I will relate the karma I remember Creating in a past time,

source: །དེ་ནི་ཐུབ་པའི་སྤྱན་སྔར་གསོལ།
en: In the Muni’s presence. “The stūpa of the Buddha Padmottara,

source: །འཇིག་རྟེན་གཙོ་བོ་སྐྱོབ་པ་པོ། །སངས་རྒྱས་པད་མ་བླ་མ་ཡི།
en: Master and protector of the world,

source: །མཆོད་རྟེན་ཚལ་སྟུག་བཞུགས་པ་ནི།
en: Stood in a forest,

source: །རི་དགས་གདུག་པ་རྣམས་ཀྱིས་བསྟེན།
en: Surrounded by harmful beasts. “There was no one

source: །མཆོད་རྟེན་དེ་ལ་ཕྱག་བགྱིད་པ། །རྔོ་ཐོག་པ་ནི་འགའ་མ་མཆིས།
en: Capable of worshiping the stūpa.

source: །མི་དེ་རྣམས་ནི་བསོད་ནམས་དང་། །སྡིག་པ་རབ་ཏུ་མ་འཚལ་ཏོ།
en: Those people did not understand Either merit or sin.

source: །བདག་གིས་སོང་ནས་ཤིང་རྣམས་དང་། །རྩྭ་རྣམས་བསལ་བ་བགྱིས་ནས་ནི།
en: “I went there, removed Trees and grass,

source: །ཕྱགས་མ་དག་ནི་བླངས་ནས་ཀྱང་།
en: Then took a broom

source: །དེ་ནས་ཐམས་ཅད་ཕྱག་དར་བགྱིས།
en: And cleaned everything.

source: །བསྐོར་བ་བརྒྱད་དང་ཕྱག་བགྱིས་ཏེ། །མཆོད་པ་བགྱིས་ནས་སླར་ལོག་ལགས།
en: “Having circumambulated it eight times, And worshiped and venerated it, I went home.

source: །དགེ་བའི་རྩ་བ་དེས་ན་བདག །ལྷ་རྣམས་སུ་ནི་སྐྱེས་པ་ན།
en: Because of this root of merit, I was born among the gods.

source: །འདོད་པ་ཐམས་ཅད་འབྱོར་གྱུར་ཅིང་།
en: “Rich with every object of desire,

source: །སུམ་བཅུ་རྩ་གསུམ་རྣམས་སུ་དགའ།
en: I enjoyed myself among the Thirty-Three Gods.

source: །ལྷ་ཡུལ་ལྷ་ཡི་རྒྱལ་སྲིད་ནི།
en: In the divine realm, I reigned

source: །སུམ་བཅུ་རྩ་དྲུག་བར་དུ་བགྱིས།
en: Over that divine kingdom thirty-six times.

source: །དེ་ན་བདག་གི་གནས་མཆིས་པ།
en: “There, my dwelling place

source: །གསེར་གྱི་འོད་ནི་ཤིན་ཏུ་གསལ།
en: Was very bright with golden light

source: །རྒྱར་ནི་དཔག་ཚད་སུམ་བཅུ་དྲུག །ཁོར་ཡུག་དཔག་ཚད་དྲུག་བཅུ་ཐམ།
en: Thirty-six yojanas in width And sixty yojanas in length. “Another wonder

source: །རྒྱལ་བའི་མཆོད་རྟེན་དེ་ཕྱགས་ནས། །ངོ་མཚར་བྱུང་བ་གཞན་ཡང་ནི།
en: Caused by cleaning the Victor’s stūpa

source: །མི་ཡི་ནང་དུ་མི་དབང་ནི།
en: Was that I, as the master of the people,

source: །ལན་བདུན་བར་དུ་བགྱིས་པར་གྱུར། །རྒྱལ་བའི་མཆོད་རྟེན་དེ་ཕྱགས་ནས།
en: Reigned over the masses seven times.

source: །ངོ་མཚར་བྱུང་བ་གཞན་ཡང་ནི།
en: “Another wonder Caused by cleaning the Victor’s stūpa

source: །བདག་གི་ལུས་ཀྱི་གཟི་བརྗིད་ནི།
en: Was that the color of my body

source: །གསེར་གྱི་ཁ་དོག་ལྟ་བུར་གྱུར། །རྒྱལ་བའི་མཆོད་རྟེན་དེ་ཕྱགས་ནས།
en: Was as bright as gold.

source: །བྲམ་ཟེ་དང་ནི་རྒྱལ་རིགས་དང་། །རིགས་གཉིས་སུ་ནི་བདག་སྐྱེས་ལགས།
en: Was that I was born into either of two castes, Namely, brahmin and kṣatriya. “Another wonder

source: །རྒྱལ་བའི་མཆོད་རྟེན་ཕྱགས་ནས་ནི།
en: Caused by cleaning the Victor’s stūpa

source: །བདག་ལ་ངོ་མཚར་གཞན་བྱུང་བ།
en: Was that I used to travel

source: །ཁྱོགས་དང་གླང་ཆེན་སྟོང་དང་ནི།
en: In a palanquin, on an elephant’s back, and in the best vehicle.

source: །བཞོན་པ་མཆོག་ནི་རྣམས་ཀྱིས་མཆི།
en: “Another wonder

source: །བདག་གི་མདུན་ན་སྡོང་དུམ་དང་། །ཚེར་མ་གྱོ་མོ་རང་ཉིད་སེལ། །རྒྱལ་བའི་མཆོད་རྟེན་དེ་ཕྱགས་ནས།
en: Thorns, and gravel moved aside by themselves.

source: །སྐད་ཅིག་ཙམ་ཡང་བདག་གིས་སུ།
en: Caused by cleaning the Victor’s stūpa

source: །བྲོ་འཚལ་བར་ནི་མི་དྲན་ལགས།
en: Was that I do not remember Becoming sick even once. “Another wonder

source: །རྒྱལ་བའི་མཆོད་རྟེན་ཕྱགས་ནས་ནི། །བདག་ལ་ངོ་མཚར་གཞན་བྱུང་བ།
en: Caused by cleaning the Victor’s stūpa

source: །གང་དང་གང་དུ་བདག་མཆི་བར།
en: Was that wherever I went,

source: །ཀུན་དུ་བཀྲ་ཤིས་ཕུན་སུམ་ཚོགས། །རྒྱལ་བའི་མཆོད་རྟེན་དེ་ཕྱགས་ནས།
en: There was an abundance of prosperity.

source: །རྟག་ཏུ་བཀུར་ཞིང་མཆོད་པས་ན།
en: Caused by cleaning the Victor’s stūpa

source: །ལྷ་ཡི་སྤྱོད་པ་ལྟ་བུ་མཆི།
en: Was that I always behaved like a god,

source: །སྐྱོབ་པའི་མཆོད་རྟེན་ཕྱགས་ནས་ནི།
en: And was served and venerated.

source: །བདག་གིས་ལུས་ལ་ལན་འགའ་ཡང་།
en: Caused by cleaning the Protector’s stūpa

source: །གནོད་པ་བྱུང་བར་མི་དྲན་ལགས།
en: Was that I do not remember Any illness attacking my body even once.

source: །དེ་ལྟར་སངས་རྒྱས་སངས་རྒྱས་ཆོས།
en: “Thus, the Buddha and his Dharma

source: །དྲི་མ་མེད་པ་བསམ་མི་ཁྱབ།
en: Are taintless and inconceivable.

source: །བསམ་མི་ཁྱབ་ལ་མངོན་དད་པའི།
en: Having faith in inconceivable ones

source: །རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཆེ།
en: Bears great fruit.

source: །དེ་བས་རྒ་ཤི་ཟད་པ་དང་། །ཕུན་སུམ་འབྱོར་པ་འདོད་པས་ནི།
en: “Therefore, those who wish to exhaust old age and death And desire perfection Should offer supreme veneration

source: །རྒྱལ་བ་ཡི་ནི་མཆོད་རྟེན་ལ། །མཆོད་པ་བླ་ན་མེད་པ་གྱིས།
en: To a Victor’s stūpa.

source: །དེ་ཡི་འབྲས་བུ་ཡིད་འོང་ཞིང་། །བདེ་འབྱུང་འདོད་པ་ཉམས་སུ་མྱོང་།
en: Desirable fruit, which causes happiness.”

source: །དེ་ལྟར་དགེ་སློང་འོད་བྱེད་ཀྱིས།
en: Thus the monk Prabhākara Explained his karma,

source: །འོད་བྱེད་ཀྱི་ལེའུ་སྟེ་སུམ་བཅུ་རྩ་ལྔ་པའོ།། །།
en: Here ends the thirty-fifth section: The Section of Prabhākara. 6. Revata

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ནམ་གྲུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Revata, “O Venerable Revata, the venerable Prabhākara has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་ནམ་གྲུ་ཚེ་དང་ལྡན་པ་འོད་བྱེད་ཀྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Revata, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་ནམ་གྲུས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ནམ་གྲུས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Revata did explain his karmic bond:

source: འདི་ནས་བསྐལ་པ་བྱེ་བའི་སྔོན།
en: “Ten million eons ago,

source: །སངས་རྒྱས་ཀུན་ཟིལ་གནོན་དེ་ལ། །བདག་གིས་དགེ་བ་གང་བགྱིས་པ།
en: I performed a good deed For the Buddha Sarvābhibhū.

source: །བཙུན་པ་བདག་གིས་དྲན་ལགས་ཏེ།
en: I remember it, O honored ones. “When, attended by

source: །བརྒྱ་སྟོང་ཕྲག་ནི་དུ་མ་ཡི། །ཉན་ཐོས་རྣམས་ཀྱིས་མདུན་བདར་ནས།
en: Hundreds of thousands of disciples, That most excellent man went

source: །རྒྱལ་པོའི་ཕོ་བྲང་དཔེ་མེད་དུ། །སྐྱེས་བུ་དམ་པ་གཤེགས་པ་ན། །བདག་ཀྱང་དགོས་པ་ཞིག་གི་ཕྱིར།
en: To the incomparable royal capital,

source: །གྲོང་ཁྱེར་གཞན་ནས་དེར་ཕྱིན་ནས།
en: “I also arrived there from another city On some business.

source: །དེ་ན་རྫོགས་པའི་སངས་རྒྱས་ནི།
en: I saw there the Completely Awakened One

source: །མཚན་མཆོག་སུམ་བཅུ་རྩ་གཉིས་ལྡན།
en: With the supreme thirty-two marks,

source: །མེ་དང་ནོར་བུ་གློག་འོད་དང་། །ཉི་མ་ཟླ་བའི་འོད་འདྲ་མཐོང་།
en: “Appearing like fire, a jewel, lightning, Sunlight, and moonlight.

source: །འོད་ཀུན་ཟིལ་གྱིས་མནན་ནས་ནི།
en: Surpassing every kind of light,

source: །སངས་རྒྱས་གཟི་བརྗིད་ཁྱད་པར་འཕགས། །གཟི་བརྗིད་མེ་ཕུང་ལྟ་བུ་སྟེ། །སྔོན་མ་མཐོང་བ་མཐོང་ནས་ནི།
en: The Buddha’s splendor was especially noble. “Having seen the one whom I had never seen, Whose splendor was like a ball of fire,

source: །བདག་གི་མདུན་ན་འདུག་པ་ཡི། །བྲམ་ཟེ་ཞིག་ལ་དྲིས་པ་དང་། །དྲིས་པས་བདག་ལ་འདི་སྐད་སྨྲས།
en: I asked a brahmin Who was in front of me. “Upon being asked, he said to me,

source: །འདི་ནི་སངས་རྒྱས་རྣམ་འདྲེན་པ།
en: ‘This is the Buddha, the Leader,

source: །ལྷ་དང་མི་མཆོག་རྫོགས་སངས་རྒྱས། །ཟླ་མེད་པ་ཡི་གང་ཟག་ཡིན།
en: The best of gods and humans, the Completely Awakened One, The supreme man.’

source: །བདག་གིས་སངས་རྒྱས་སྒྲ་ཐོས་ནས།
en: “Having heard the sound buddha,

source: །དེ་ཚེ་བདག་ནི་རབ་དགར་གྱུར།
en: I was then delighted—

source: །དགའ་ཞིང་མགུ་བ་སྐྱེས་པས་ན།
en: Delighted and pleased,

source: །ལུས་ནི་ཐམས་ཅད་བདེ་བར་གྱུར།
en: I felt my entire body at peace

source: །མི་མ་ཡིན་རྣམས་ལྷ་ཡུལ་གྱི། །རོལ་མོའི་སྒྲ་རྣམས་འབྱིན་པ་ཐོས།
en: “And heard nonhumans playing Various kinds of music of the divine realm.

source: །ལྷ་ཡི་ཙན་དན་ཕྱེ་མ་ཡང་།
en: Divine sandal powder, too,

source: །གྲོང་ཁྱེར་དམ་པ་དེ་རུ་བབ།
en: Rained down on that most excellent city. “Some scattered utpala and campa flowers,

source: །ཁ་ཅིག་ཨུཏྤལ་ཙམ་པ་གཞན།
en: Others flowers of the parūṣaka,

source: །དེ་བཞིན་པ་རི་ཤ་ཀ་དང་། །གཞན་དག་ཙན་དན་ཕྱེ་མ་འཐོར།
en: And others sandal powder.

source: །བདག་ནི་ཐལ་མོ་སྦྱར་བྱས་ནས།
en: “I made the gesture of supplication

source: །ཡིད་ནི་མགུ་ཞིང་རངས་པ་ཡིས།
en: And, pleased and delighted,

source: །ནམ་མཁའ་ལ་ནི་འཕགས་ཏེ་གནས།
en: Soared up into the sky and stayed there.

source: །དགའ་དང་རབ་ཏུ་དགའ་བ་ཡིས། །ལུས་ཀུན་ཏུ་ནི་ཁྱབ་པར་གྱུར།
en: My entire body Was filled with joy and delight. “I ran around

source: །དྲི་དང་ཕྲེང་བ་ལ་སོགས་ཕྱིར།
en: Seeking perfume and flowers,

source: །མཐའ་དག་ཏུ་ནི་བརྒྱུགས་པ་ལས། །དེ་ཡི་ཚེ་ན་བསྐོར་ཀྱང་ནི། །མེ་ཏོག་གཅིག་ཀྱང་མ་རྙེད་དོ།
en: But there were no flowers

source: །དེ་ཚེ་དེ་ན་བདག་གིས་ནི། །ཧ་ཅང་རིང་བ་མ་ཡིན་པར།
en: Nearby me at that time.

source: །གདུགས་བྱེད་པ་ཡི་ཚོང་ཁང་ན།
en: “Then, just there,

source: །དུང་ལྟར་དཀར་བའི་གདུགས་ཤིག་མཐོང་།
en: I saw a parasol As white as a conch shell In a nearby parasol shop. “Seeking the parasol,

source: །གདུགས་ཕྱིར་བདག་གིས་དེ་ལ་ནི།
en: I entreated them for it. When I received the parasol,

source: །གསོལ་བཏབ་ནས་ནི་གདུགས་བླངས་ཏེ།
en: I raised it over the Buddha,

source: །སེམས་ནི་རབ་ཏུ་དང་བ་ཡིས། །སངས་རྒྱས་ལ་ནི་གདུགས་བཟུང་ངོ་།
en: My mind filled with faith.

source: །བདག་གི་ལག་ནས་གདུགས་ཤོར་བ།
en: “The parasol left my hand

source: །བར་སྣང་དག་ལ་མངོན་འཕགས་ནས།
en: And soared up into the air.

source: །སྟོན་པ་གཤེགས་ན་གདུགས་འགྲོ་ཞིང་།
en: It moved when the Teacher walked,

source: །བཞུགས་པ་ན་ཡང་སྡོད་པར་གྱུར།
en: And it stopped when he stopped.

source: །ནམ་མཁའི་ངོས་ལ་སྤྲིན་ལྟ་བུར།
en: “From the sky, like a cloud,

source: །སངས་རྒྱས་ལ་ནི་གྲིབ་མ་བྱེད།
en: It cast a shadow over the Buddha.

source: །ཐུབ་པའི་སྐུ་ནི་མི་འདོར་བར།
en: Not leaving the body of the Muni,

source: །བར་སྣང་ལ་ནི་འདུག་པར་གྱུར།
en: It remained in the air. “When we observed these miracles,

source: །དེ་ནས་བདག་དང་སྐྱེ་བོ་གཞན། །ཆོ་འཕྲུལ་རྣམས་ལ་བརྟགས་ནས་ནི།
en: I and other people

source: །དེ་བཞིན་གཤེགས་ལ་མགོས་ཕྱག་བྱས།
en: And bowed to the Tathāgata.

source: །དེ་ནས་རྫོགས་པའི་སངས་རྒྱས་དང་། །ཉན་ཐོས་མཚན་མ་བཟུང་ནས་ནི།
en: “Then, having understood the marks Of the Completely Awakened One and his disciples

source: །རྗེས་སུ་དྲན་པས་ཡིད་དགའ་ཞིང་།
en: And memorized them,

source: །ཁྱིམ་གྱི་ལས་ཀྱི་མཐའ་བྱས་སོ།
en: I accomplished my household work with pleasure.

source: །ཀྱེ་མའོ་ཐོབ་པ་ལེགས་ཐོབ་སྟེ། །སངས་རྒྱས་མཐོང་ནས་དྲན་པ་རྙེད།
en: “Ah, I have profited well To have seen the Buddha and remembered him! I offered the parasol to the Completely Awakened One,

source: །ཡོན་ཏན་བླ་ན་མེད་པ་ནི།
en: Who possessed supreme good qualities. “Because of that root of merit,

source: །རྫོགས་སངས་རྒྱས་ལ་བདག་གིས་ཕུལ།
en: Which was my offering of a parasol

source: །ཡོན་གནས་བླ་ན་མེད་པ་ལ།
en: To the supreme field of merit,

source: །བདག་གིས་གདུགས་ཕུལ་གང་ཡིན་པའི། །དགེ་བའི་རྩ་བ་དེས་ན་བདག །རིན་ཆེན་བདུན་དང་ལྡན་པར་གྱུར།
en: I was endowed with the seven treasures.

source: །དེ་ནས་སུམ་བཅུ་རྩ་གསུམ་པའི། །ལྷ་ཡི་ནང་དུ་བདག་སྐྱེས་ཏེ།
en: “After that, I was born Among the Thirty-Three Gods.

source: །ལྷ་ཡི་རྒྱལ་པོར་བདག་གྱུར་ནས།
en: Having become the king of those gods,

source: །ལྷ་ནི་བྱེ་བ་རྣམས་ཀྱིས་མཆོད།
en: I was venerated by ten million gods.

source: །སྟོབས་ཀྱིས་སྒྱུར་བའི་རྒྱལ་གྱུར་ཅིང་།
en: I became a king ruling through power,

source: །ནོར་ཆེན་བརྩོན་འགྲུས་ཆེ་བ་སྟེ།
en: Who possessed much wealth and great majesty

source: །རྒྱལ་པོ་རྣམས་ཀྱིས་མདུན་གྱིས་བལྟས།
en: And was attended even by other kings.

source: །བདག་གིས་ལས་འདི་བྱས་པས་ནི།
en: “Since I had created this karma,

source: །ཡང་དང་ཡང་དུ་འཁོར་བ་ནའང་།
en: However many times I transmigrated,

source: །བདག་བྱེད་པ་ཡི་ལས་དེ་ནི།
en: The karma I created

source: །ལན་འགའང་བར་ནི་མ་བཅད་དོ།
en: Was never interrupted.

source: །དེ་ལྟ་བུ་ཡི་ཡོན་གནས་ལ།
en: “Since I had created this good karma,

source: །བདག་གིས་དད་པས་ཕུལ་བ་ཡི།
en: My offering in faith

source: །དགེ་བའི་ལས་དེ་བྱས་པས་ན།
en: To such a field of merit,

source: །ངན་འགྲོར་སོང་བ་མི་དྲན་ནོ།
en: I do not remember going to any inferior state of existence.

source: །ཡང་དག་སངས་རྒྱས་བླ་མེད་པ།
en: The Supremely, Completely Awakened One.

source: །བདུད་ཀྱིས་ལུས་ནི་ལུས་ཆེན་པོ།
en: “Māra, however, created a huge body

source: །རི་བོ་ལྟ་བུ་དཔག་ཚད་ཙམ།
en: Like a mountain, as large as a yojana,

source: །ནམ་མཁའ་ལ་ནི་སྤྲིན་ལྟ་བུར།
en: Like a cloud in the sky,

source: །མདོག་མི་སྡུག་པ་སྤྲུལ་པ་དང་། །དེ་ནས་བདག་ནི་གཡེང་བྱེད་པ།
en: Which was ugly in color. “Then he frightened me.

source: །འདི་ཀོ་སུ་ཞིག་སྙམ་པ་ལས། །འདི་ནི་མཐོ་འཚམ་བྱེད་པ་ཡི།
en: I wondered what it was

source: །བདུད་ཡིན་པར་ནི་མྱུར་དུ་ཤེས།
en: And immediately realized that It was Māra, who does harm.

source: །སྡིག་ཅན་ཁྱོད་འདིར་ཅི་དགར་ཟད།
en: “ ‘Evil One, you have come here, Having transformed at will

source: །ལུས་ནི་ཁོར་ཡུག་གཅིག་ལྟ་བུ།
en: Your body like Mount Cakravāḍa

source: །མགོ་ཡང་ལྷུན་པོ་ལྟ་བུར་ནི།
en: And your head like Mount Sumeru.

source: །བྱས་ཏེ་འདིར་ནི་འོང་ལ་རག །བདག་ནི་དགྲ་བཅོམ་དབང་གྱུར་པ།
en: “ ‘I am an arhat, one who has become powerful,

source: །རིག་གསུམ་ལྡན་པའི་དགེ་སྦྱོང་སྟེ། །སངས་རྒྱས་ཀྱིས་གསུངས་གང་ཡིན་པའི། །བདེ་བར་གནས་པ་རྣམས་ཀྱང་ཐོབ། །བསོད་སྙོམས་བྱས་པ་ལན་གཅིག་གིས།
en: A śramaṇa possessed of the threefold knowledge. I have attained the peaceful state Taught by the Buddha.’

source: །ཞག་བདུན་དུ་ཡང་འདུག་ནས་ནི།
en: “I sat still for seven days With almsfood that was given just once,

source: །རྣམ་པར་གྲོལ་བའི་དགའ་མྱོང་བ།
en: And experienced the joy of liberation—

source: །དེ་ལྟ་བུ་དག་བདག་གིས་བསྒོམས།
en: Thus I practiced.

source: །གང་བགྱིས་དྲན་པ་འདི་ལགས་ཏེ།
en: That I remember performing. I have experienced its pleasant,

source: །དེ་ལྟར་ནམ་གྲུ་བློ་ལྡན་གྱིས།
en: Thus the Elder Revata Explained his karma,

source: །ནམ་གྲུའི་ལེའུ་སྟེ་སུམ་བཅུ་རྩ་དྲུག་པའོ།། །།
en: Here ends the thirty-sixth section: The Section of Revata. 7. The Sugata (prose)

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་རང་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ཅག་གིས་རང་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ལགས་ཀྱིས།
en: After they had each finished explaining their karmic bonds, the monks who were the most venerable of the elders requested the Blessed One, “O Honored One, we have each explained our karmic bonds.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་ཉིད་ཀྱི་ཕྲིན་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་པའི་རིགས་ལགས་སོ།
en: It would be appropriate if the Blessed One would also explain his karmic bond.” a. The Son of a Householder

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྲིན་ལས་ཅི་ཞིག་མཛད་ན། དེས་ན་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ན་ཡང་གོར་མའི་དུམ་བུས་ཞབས་ཀྱི་མཐེ་བོ་རྨ་བྱུང་བར་གྱུར་ལགས།
en: “O Honored One, what karma did the Blessed One create so that he was injured on his big toe with a piece of stone while being the Buddha, who had perfectly accomplished awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་གཞན་རྣམས་སུ་ལས་རྣམས་བྱས་ཤིང་བསགས་པ་ཚོགས་རྙེད་པ་ཞེས་བྱ་བ་ནས།
en: “Monks,” the Blessed One replied, “the actions were performed and accumulated by the Tathāgata himself in other lives in the past, accruing a heap of karma . . . “. . .

source: འབྲས་བུ་དག་ཏུ་འགྱུར་བ་ཉིད་ཅེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: “They bear fruit in embodied beings.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་འོར་ཞིག་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ཏེ། དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་ཅེས་བྱ་བ་ནས།
en: “Monks, once there lived a certain householder in a certain hamlet. He took a wife from a family of equal rank, and he and she played, made love, and enjoyed themselves . . . .

source: ཁྱེའུ་ཞིག་བཙས་ནས་བསྐྱེད་བསྲིངས་ཏེ་ཆེན་པོར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: A boy was born and grew up.

source: །དེའི་མ་ཤི་ནས་དེ་ནས་ཁྱིམ་བདག་དེས་ཆུང་མ་གཞན་ཞིག་བླངས་ཏེ། དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད་ཅེས་བྱ་བ་ནས་དེ་ལས་ཀྱང་ཁྱེའུ་ཞིག་བཙས་སོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: After the boy’s mother died, the householder took another wife and he and she played . . . . A boy was born to her, too.

source: །དེ་ནས་ཁྱིམ་བདག་དེས་ཁྱེའུ་ཕུ་བོ་ཤོས་ཆུང་མ་བླངས་ནས་དེ་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་ཁྱེའུ་དང་བུ་མོ་མང་དུ་བཙས་སོ།
en: “Then the householder arranged for a wife for his elder son. As they played, made love, and enjoyed themselves, they had many sons and daughters.

source: །ཇི་ཙམ་དུས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དང་ཆུང་མ་དང་བཅས་ཏེ་ཤི་ནས་བུ་དེ་ཕུ་བོ་ཉིད་ཀྱི་དྲུང་དུ་སོང་བ་དང་། ཆུང་མས་སྨྲས་པ།
en: Later, the householder and his wife died. The younger son went to see his brother.

source: རྗེའི་སྲས་ཁྱེའུ་འདི་ཁྱོད་ཀྱི་ཅིར་མཆི་ལགས།
en: The wife asked, ‘My dear, this boy who has come to us, who is he to you?’

source: སྤུན་དུ་འོང་ངོ་། །རྗེའི་སྲས་ཅི་འདི་ཡང་ཁྱིམ་གྱི་བགོ་སྐལ་དབང་ངམ།
en: “ ‘My dear, does he also have a right to a share of our family’s property?’

source: འདི་ལ་ཡང་ཕྱེད་ལ་བདག་ཅག་ལ་ཡང་ཕྱེད་ཡིན་ནོ།
en: “ ‘He gets one half, and we the other half.’

source: །རྗེའི་སྲས་འདི་ནི་མི་གཅིག་པ་ལགས་ན། ཇི་ལྟར་འདི་ལ་ཡང་ཕྱེད་ལ་བདག་ཅག་མང་པོ་ལ་ཡང་ཕྱེད་ལགས།
en: “ ‘My dear, while this one is single, why does he get one half, and we, who are many, the other half?’

source: བཟང་མོ་འདི་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཡིན་ནོ།
en: “ ‘Good lady, this is the law of the world.’

source: །རྗེའི་སྲས་གལ་ཏེ་དེ་ལྟ་ན་འདི་ཁུམས་ཤིག །བཟང་མོ་ནོར་གྱི་ཕྱིར་ནུ་བོ་བསད་དུ་ག་ལ་རུང་།
en: “ ‘My dear, if this is so, kill him!’ “ ‘Good lady, how could it be right to kill a brother for the sake of property?’

source: དེས་དེ་ལ་ཡང་དང་ཡང་དུ་སྨྲས་པ་དང་འདོད་པ་ལ་བསྟེན་པས་ནི་སྡིག་པའི་ལས་མི་བྱ་བ་ཅི་ཡང་མེད་པས་དེས་ཁས་བླངས་སོ།
en: “She insisted on this again and again. Since there is no evil act that those who follow desire cannot perform, he consented.

source: །དེས་བསམས་པ། གལ་ཏེ་གྲོང་དུ་གསད་ན་ནི་སྐྱེ་བོ་མང་པོས་ཚོར་བར་འགྱུར་གྱིས།
en: He thought, ‘If I kill him in the village, many people will come to know about it.

source: དགོན་པར་གསད་པར་བྱའོ་སྙམ་ནས་དེས་དེ་བོས་ཏེ་སྨྲས་པ།
en: So, I will kill him in the wilderness.’

source: ནུ་བོ་མེ་ཏོག་དང་ཡམ་སྲེག་ཤིང་གི་ཕྱིར་དགོན་པར་འདོང་ངོ་།
en: “He called his brother and said, ‘Brother, let us go into the wilderness to collect flowers and firewood.’

source: །དེ་དེ་དང་ལྷན་ཅིག་དགོན་པར་དོང་བ་ལས་དེ་ནས་དེས་རི་ཕུག་ཏུ་རྡོས་བསྣུན་ཏེ་བསད་དོ།
en: “He went to the wilderness with his brother, and then he beat him to death with a stone in a cave.
